{
  "title": "Get to know Staking",
  "description": "Staking is an important concept of proof-of-stake blockchain networks and the easiest way to participate in the networks.",
  "stakingYourTokens": "Staking your tokens",
  "stakingYourTokensDetails": "Led by a team of experienced experts, Forbole has a proven track record in staking service. You stake with us, earn passive income in crypto, while we secure the networks. Stake with us now!",
  "whatIsStaking": "What’s “staking”?",
  "whatIsStakingDetailsOne": "The technology of proof-of-stake (PoS) has been evolved since it was first introduced in 2012. Instead of the miners in proof-of-work blockchains, proof-of-stake blockchains need a role called validators to provide the security infrastructure for the chains. Generally speaking, validators run a full-node and participate in consensus. Validators commit new blocks in the blockchain and receive revenue in exchange for their work.",
  "whatIsStakingDetailsTwo": "A responsible validator is also expected to participate in the governance by voting on proposals.",
  "aboutPOS": "About PoS:",
  "aboutPOSDetailsOne": "Proof-of-Stake is a blockchain consensus mechanism first brought up by Sunny King (see V.SYSTEMS) in order to tackle the energy consumption issue of Proof-of-Work mechanism, which solves the scalability dilemma of PoW blockchain, paving out a path for mass adoption of blockchain technology in the future. The first cryptocurrency to adopt PoS is peercoin by Sunny King.",
  "aboutPOSDetailsTwo": "Compared to Proof-of-Work mechanism, Proof-of-Stake has below features:",
  "lowLevel": "Low level of energy consumption:",
  "lowLevelDetails": "PoS does not rely on neither electricity nor computational power for block validation.",
  "scalability": "Unlimited level of scalability:",
  "scalabilityDetails": "since the validation process is not restricted by hardware or electricity constraints, in theory, PoS blockchains carry unlimited level of scalability.",
  "randomBlockGenerator": "Random block generation:",
  "randomBlockGeneratorDetails": "the process of block generation is “minting” in contrast to “mining” in Bitcoin/PoW blockchains. PoS blockchain also generates blocks in a random process like Bitcoin, only an average block interval or a target block interval can be observed.",
  "coinAge": "Coin age:",
  "coinAgeDetails": "a number that is derived from multiplying the amount of coins a minter owns by the number of days those coins have been held in their wallet. A minter with a high coin age has a higher probability of minting the next block over a minter with a low coin age.",
  "stakeIsPower": "Stake is power & user governance:",
  "stakeIsPowerDetails": "coin owners are the ones who wield influence over the network, produce new blocks and secure the chain. The amount of stake participating in minting is directly related to the security level of the consensus. This user governance is only possible because proof-of-stake grants power over the network to stakeholders.",
  "aboutPOSDetailsThree": "In some cases (eg. Cosmos Hub), validators are weighted according to their total stake. This “stake” comes from the token holders who have locked-up their tokens with the validators (this process is called “delegating”). Staking is the process performed by the token holders to sacrifice something (eg. the liquidity through delegating to a validator) in order to participate in the operations of the blockchain to receive rewards.",
  "ecosystemProjects": "Ecosystem Projects",
  "ecosystemProjectsDetails": "Forbole has been providing staking-as-a-service in many renowed Proof-of-Stake networks for years."
}
